app/controllers/application_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1
---
  def authenticate_request
    if session[:jwt_token]
      begin
        decoded_token = JWT.decode(session[:jwt_token], Rails.application.secrets.secret_key_base)
        @current_user = User.find(decoded_token[0]['user_id'])