app/controllers/registrations_controller.rb

INSERT INTO `users` (`username`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('nn', 'nn@yahoo.com', '$2a$12$zJuwdKwQY5Ozrk6cfo3.VeNDLw21E1c1uqmSjse58StqCneC1RoUO', '2024-04-25 12:23:41.442546', '2024-04-25 12:23:41.442546')
---
  def create
    @user = User.new(user_params)
    if @user.save