app/controllers/users_controller.rb

INSERT INTO `users` (`username`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('meysam', 'meysamzohouri.mehriz@gmail.com', '$2a$12$vpE/4WW5sDbCqSt3BcHRKO4S6Ne1B3tQLVF9LWqFN8yfEvE2MBou6', '2024-04-16 19:32:06.754221', '2024-04-16 19:32:06.754221')
---
    def create
        @user = User.new(user_params)
        if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 12 LIMIT 1
UPDATE `users` SET `users`.`username` = 'qq', `users`.`email` = 'qq@yahoo.com', `users`.`password_digest` = '$2a$12$XQbANCvQXTEeo.m1SGZwju/ArFuy7kPEQZQPPWMN.bfy8u0i6R362', `users`.`updated_at` = '2024-04-25 12:36:00.623975' WHERE `users`.`id` = 12
---
    def update
        @user = User.find(params[:id])
        if @user.update(user_params)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 13 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 13
---
    def destroy
        @user = User.find(params[:id])
        @user.destroy

SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
---
        def set_user
            @user = User.find(params[:id])